Documents/бит_РегистрацияПроживающихПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РегистрацияПроживающихПоЛС</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПроживающиеПоЛС</xr:Item>
				<xr:Item>InformationRegister.бит_ОтветственныеЛицаПоКУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПроживающих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецКвартиры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрибытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятияСРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПраваСобственности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписанАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибыл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибылАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоустанавливающиеДокументы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВыписки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПрописки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроживания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛицаДляИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_ДоляПлощадиСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_СтрокаРодствДляФЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_СтатусСтрокиДляФЛС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.лб_ОсобенностиСтрокиРегистрации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ПомещенВАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/лб_ОсобенностиСтрокиРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>лб_ОсобенностиСтрокиРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОставитьЖильцаНаЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖилецУжеБылВыписанРанее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_РегистрацияПроживающихПоЛС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мТаблицаФизЛицДолей Экспорт; // Хранит таблицу физ лиц и долей площади

Перем мНачислениеСУчетомДнейПроживания; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "ЛицевойСчет";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Физлицо"; //через запятую
	
	СтруктураОбязательныхПолей = Новый Структура(РеквизитыТабСписокУслуг);
	
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.СписокПроживающих.Представление();
	
	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().ТабличныеЧасти.СписокПроживающих.Реквизиты;
	
	Для каждого СтрокаТаблицы Из СписокПроживающих Цикл
		
		СтрокаНачалаСообщенияОбОшибке = "Строка номер "+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		" табличной части """ + " Список проживающих" + """: ";
		
		// Цикл по проверяемым полям.
		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
			
			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			
			Если НЕ ЗначениеЗаполнено(Значение) Тогда 
				
				Если СтрокаТаблицы.ВладелецКвартиры = Перечисления.ДаНет.Да И КлючЗначение.Ключ  = "ДатаРегистрации" Тогда
					
					Продолжить;
					
				КонецЕсли; 
				
				Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """.";
					
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
					
				КонецЕсли;
				
				бит_ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// БИТ_ЖКХ 
	// Удален закоментированный участок кода.
	
	Если Не Отказ тогда
		Для Каждого ТекСтрока Из ТаблицаОС Цикл	 
			
			Если  ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) И Не ЗначениеЗаполнено(ТекСтрока.ПричинаВыписки) Тогда
				бит_ОбщегоНазначения.ОшибкаПриПроведении("У физ. лица "+ТекСтрока.ФизЛицо+" не заполнен рекзвизит ""Причина выписки""", Отказ, Заголовок)
			КонецЕсли;
			
			Если ТекСтрока.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан И НЕ ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) Тогда
				бит_ОбщегоНазначения.ОшибкаПриПроведении("У физ. лица "+ТекСтрока.ФизЛицо+" статус ""Выписан"", необходимо заполнить рекзвизит ""Дата снятия с регистрации""", Отказ, Заголовок)
			КонецЕсли;
			
		КонецЦикла;  
	КонецЕсли;
		
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура проверяет добли строк.
//
Процедура ПроверитьДублиФизлиц(ТаблицаПоФизЛицам, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоФизЛицам.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	ТаблицаДублей.Свернуть("ФизЛицо", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// ТаблицаПоЦБ.Индексы.Добавить("Контрагент");.
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // Повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоФизЛицам.НайтиСтроки(Новый Структура("ФизЛицо", СтрокаТаблицыДублей.ФизЛицо));
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Физ. лица"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	Если Не Отказ тогда
		ТаблицаПроживающихСкоп = ТаблицаПоФизЛицам.Скопировать(Новый Структура("СтепеньРодства",Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо));
		КоличествоСовпадений = 0;
		Для Каждого ТекСтрока Из ТаблицаПроживающихСкоп Цикл 
			Если ТекСтрока.ДатаСнятияСРегистрации = '00010101' ИЛИ 
				ТекСтрока.ДатаСнятияСРегистрации >= КонецМесяца(Дата)
				ИЛИ ТекСтрока.лб_СтатусСтрокиДляФЛС = Перечисления.лб_ОсобенностиСтрокиРегистрации.ОставитьЖильцаНаЛС тогда	
				КоличествоСовпадений = КоличествоСовпадений + 1;
			КонецЕсли;	
		КонецЦикла;	
		Если КоличествоСовпадений > 1 Тогда
			бит_ОбщегоНазначения.ОшибкаПриПроведении("На лицевом счете должен быть один ответственный.",Отказ, Заголовок);
		ИначеЕсли КоличествоСовпадений = 1 Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
			|			&Момент,
			|			ЛицевойСчет = &ЛицевойСчет
			|				И (НЕ ФизЛицо В (&ФизЛицо))) КАК бит_ПроживающиеПоЛССрезПоследних
			|ГДЕ бит_ПроживающиеПоЛССрезПоследних.Период >= &НачалоМесяца и
			|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент        
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
			|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)";
			Запрос.УстановитьПараметр("началомесяца",началомесяца(Дата));			   
			Запрос.УстановитьПараметр("Момент",КонецМесяца(Дата));			   
			Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
			Запрос.УстановитьПараметр("ФизЛицо",ТаблицаПроживающихСкоп.ВыгрузитьКолонку("ФизЛицо"));
			Если Не Запрос.Выполнить().Пустой() тогда
				бит_ОбщегоНазначения.ОшибкаПриПроведении("На лицевом счете уже есть один ответственный.",Отказ, Заголовок);
			КонецЕсли;	
		ИначеЕсли КоличествоСовпадений = 0 Тогда 	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
			|ИЗ
			|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
			|			&Момент,
			|			ЛицевойСчет = &ЛицевойСчет
			|				И (НЕ ФизЛицо В (&ФизЛицо))) КАК бит_ПроживающиеПоЛССрезПоследних
			|ГДЕ
			|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент  
			|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
			|	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
			|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)";
			Запрос.УстановитьПараметр("Момент",КонецМесяца(Дата));
			Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
			Запрос.УстановитьПараметр("ФизЛицо",ТаблицаПроживающихСкоп.ВыгрузитьКолонку("ФизЛицо"));
			Если Запрос.Выполнить().Пустой() тогда
				бит_ОбщегоНазначения.ОшибкаПриПроведении("На конец месяца, на лицевом счете: "+ ЛицевойСчет +" не установлен ответственный.",, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоФизЛицам,Отказ, Заголовок)
	
	ДатаДока = Дата;
	НачислениеПоУсл = Движения.бит_ПроживающиеПоЛС;
	
	Для каждого СтрокаТЧ Из ТаблицаПоФизЛицам Цикл
		Движение = НачислениеПоУсл.Добавить();
		Движение.Период                 		= ДатаДока;
		Движение.ЛицевойСчет            		= СтруктураШапкиДокумента.ЛицевойСчет;
		Движение.ФизЛицо                		= СтрокаТЧ.ФизЛицо;
		Движение.СтатусФизЛица          		= СтрокаТЧ.СтатусФизЛица;
		Движение.СтатусПроживания       		= СтрокаТЧ.СтатусПроживания;
		Движение.ДатаРегистрации        		= СтрокаТЧ.ДатаРегистрации;
		Движение.ДатаСнятияСРегистрации 		= СтрокаТЧ.ДатаСнятияСРегистрации;
		Движение.СтепеньРодства         		= СтрокаТЧ.СтепеньРодства;
		Движение.ДатаЗаписи             		= СтрокаТЧ.ДатаЗаписи;
		Движение.ВладелецКвартиры       		= СтрокаТЧ.ВладелецКвартиры;
		Движение.ПричинаВыписки         		= СтрокаТЧ.ПричинаВыписки;
		// БИТ_ЖКХ добавление кода Начало: 16.04.2012 
		Движение.ПричинаПрописки         		= СтрокаТЧ.ПричинаПрописки;
		//++АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя
		//Движение.лб_ДатаВыпискиДляФЛС = ?(СтрокаТЧ.лб_СтатусСтрокиДляФЛС = Перечисления.лб_ОсобенностиСтрокиРегистрации.ОставитьЖильцаНаЛС 
		//							ИЛИ СтрокаТЧ.ДатаСнятияСРегистрации = Дата(1,1,1), 
		//							"", Строка(СтрокаТЧ.ДатаСнятияСРегистрации));          
		//							
		//Движение.лб_ДоляПлощадиСтрокой         		= СтрокаТЧ.лб_ДоляПлощадиСтрокой;  
		//Движение.лб_СтрокаРодствДляФЛС         		= СтрокаТЧ.лб_СтрокаРодствДляФЛС;  
		//Движение.лб_СтатусСтрокиДляФЛС         		= СтрокаТЧ.лб_СтатусСтрокиДляФЛС;     
		//Движение.бит_ПомещенВАрхив         		= СтрокаТЧ.бит_ПомещенВАрхив;     
		
		//--АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя
		
		// БИТ_ЖКХ 23.12.2014{{
		Движение.КудаВыписан            		= СтрокаТЧ.КудаВыписанАдрес;
		Движение.ОткудаПрибыл            		= СтрокаТЧ.ОткудаПрибылАдрес;
		
		Движение.ДатаПрибытия            		= СтрокаТЧ.ДатаПрибытия;
		
		// БИТ_ЖКХ 23.12.2014}}
		
		Движение.ПравоустанавливающиеДокументы  = СтрокаТЧ.ПравоустанавливающиеДокументы;
		Движение.СтатусФизЛицаДляИзменения      = СтрокаТЧ.СтатусФизЛицаДляИзменения;
		
		// БИТ ЖКХ 25.06.2020
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
	//	Запрос.УстановитьПараметр("Организация", Объект.ЛицевойСчет.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСоДняПраваСобственности КАК НачислениеСоДняПраваСобственности
		|ИЗ
		|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата,) КАК бит_НастройкаПараметровЖКХСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НачислениеСоДняПраваСобственности = Выборка.НачислениеСоДняПраваСобственности;
		Иначе	
			НачислениеСоДняПраваСобственности = Ложь;
		КонецЕсли;

		если НачислениеСоДняПраваСобственности = истина тогда
		 Движение.ДатаПраваСобственности    		= СтрокаТЧ.ДатаПраваСобственности;
	    иначе
		 Движение.ДатаПраваСобственности    		= неопределено;
		конецесли; 
		
		Если СтрокаТЧ.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда
			ДвижениеОтв = Движения.бит_ОтветственныеЛицаПоКУ.Добавить();
			ДвижениеОтв.Период      = ДатаДока;
			ДвижениеОтв.ЛицевойСчет = СтруктураШапкиДокумента.ЛицевойСчет;
			ДвижениеОтв.ФизЛицо     = СтрокаТЧ.ФизЛицо;
			ДвижениеОтв.Контрагент  = СтрокаТЧ.Контрагент;
			ДвижениеОтв.ДоговорКонтрагента  = СтрокаТЧ.ДоговорКонтрагента;
			
		КонецЕсли;
		// БИТ_ЖКХ добавление кода Начало: 20.08.2010 
		Движение.ДоляПлощади = ?(СтрокаТЧ.ВладелецКвартиры = Перечисления.ДаНет.Да,СтрокаТЧ.ДоляПлощади,0);
		// БИТ_ЖКХ добавление кода конец : 20.08.2010
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

//БИТ Михайлов работы по ЛТ№74 10.01.2022
&наСервере
Функция НазначениеОтветственногоПоЛСНаСервере()
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	               |ГДЕ
	               |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	               |	И бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЭтотОбъект.ЛицевойСчет);
	Количество = Запрос.Выполнить().Выбрать().Количество();
	Если Количество <= 1 ТОгда
		Возврат Ложь;
	//ИначеЕсли Количество = 0 Тогда
	//	Сообщить("На лицевом счете должен быть ответственный");
	//	Возврат ложь;
	Иначе   
		Сообщить("На лицевом счете не может быть более 1 ответственного");
		Возврат Истина;
	КонецЕсли;
	
	//Отказ = ложь;
	//ТекОтв = новый Массив; //текущие ответственные по ЛС
	//ВыпОтв = новый Массив; //Выписываемые ответственные по ЛС
	//НовОтв = новый Массив; //Назначаемые ответственные по ЛС
	//
	////получаем новых и выписываемых ответственных из ТЧ
	//СтепРод = справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
	//ОтветственныйТЧ = Справочники.бит_СтепениРодстваФизЛиц.ПустаяСсылка();
	//Для каждого строка из ЭтотОбъект.СписокПроживающих Цикл
	//	Если Строка.СтепеньРодства = СтепРод
	//		И Строка.ДатаСнятияСРегистрации = '00010101' Тогда 
	//		НовОтв.Добавить(строка.ФизЛицо);
	//	ИначеЕсли
	//		Строка.СтепеньРодства = СтепРод
	//		И Строка.ДатаСнятияСРегистрации > '00010101' Тогда 
	//		ВыпОтв.Добавить(строка.ФизЛицо);
	//	КонецЕсли;
	//КонецЦикла;
	////Получаем текущих ответственного из регистра
	//Запрос = новый запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	//|	бит_ПроживающиеПоЛССрезПоследних.Регистратор.Дата КАК РегистраторДата,
	//|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
	//|ИЗ
	//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	//|			,
	//|			ЛицевойСчет = &ЛицевойСчет
	//|				И СтепеньРодства = &СтепеньРодства) КАК бит_ПроживающиеПоЛССрезПоследних
	//|ГДЕ
	//|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = &ДатаСнятияСРегистрации";
	//Запрос.УстановитьПараметр("ЛицевойСчет",ЭтотОбъект.ЛицевойСчет);
	//Запрос.УстановитьПараметр("СтепеньРодства",СтепРод);
	//Запрос.УстановитьПараметр("ДатаСнятияСРегистрации",'00010101');
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ТекОтв.добавить(Выборка.Физлицо);
	//КонецЦикла;
	////Определяем ответственных после проведения
	////Определяем останутся ли текущие ответственные
	//Ответственные = новый Массив;
	//Если ТекОтв.Количество() >0 Тогда
	//	Для каждого строка из ТекОтв Цикл
	//		Если ПереборМассива(ВыпОтв,строка) Тогда Ответственные.Добавить(строка); КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	////Определяем итоговое количество ответственных
	//Если НовОтв.Количество()>0 Тогда
	//	Для каждого строка из НовОтв Цикл
	//		Если ПереборМассива(Ответственные,Строка) ТОгда Ответственные.Добавить(строка); КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	////Проверки
	//Если Ответственные.Количество()>1 ТОгда Сообщить("Нельзя назначать более 1 ответственного"); Рез = 1; КонецЕсли; //отмена проведения
	//Если Ответственные.Количество()=0 Тогда Рез = 2; КонецЕсли; //Ответственным назначается владелец квартиры
	//Если Ответственные.Количество()=1 Тогда Рез = 3; КонецЕсли; //Типовое проведение
	//Возврат Рез;
КонецФункции
			
&наСервере
Функция ПереборМассива(Массив,Имя)
	//Если элемент есть в массиве, тогда возвращет ложь
	Для каждого строка из Массив Цикл
		Если Строка = Имя Тогда Возврат ложь; КонецЕсли;
	КонецЦикла;
	Возврат  Истина;
КонецФункции

//КонецРабот по ЛТ№74 10.01.2022	
#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ФизЛицо"                     ,"ФизЛицо");
	СтруктураПолей.Вставить("СтепеньРодства"              ,"СтепеньРодства");
	СтруктураПолей.Вставить("СтатусПроживания"            ,"СтатусПроживания");
	СтруктураПолей.Вставить("ДатаРегистрации"             ,"ДатаРегистрации");
	СтруктураПолей.Вставить("СтатусФизЛица"               ,"СтатусФизЛица");
	СтруктураПолей.Вставить("ДатаЗаписи"                  ,"ДатаЗаписи");
	СтруктураПолей.Вставить("ДатаСнятияСРегистрации"      ,"ДатаСнятияСРегистрации");
	СтруктураПолей.Вставить("ВладелецКвартиры"            ,"ВладелецКвартиры");
	СтруктураПолей.Вставить("Контрагент"                  ,"Контрагент"); 
	СтруктураПолей.Вставить("ДоговорКонтрагента"      	  ,"ДоговорКонтрагента"); 
	
	СтруктураПолей.Вставить("ПричинаВыписки"              ,"ПричинаВыписки");
	СтруктураПолей.Вставить("ПричинаПрописки"              ,"ПричинаПрописки");
	СтруктураПолей.Вставить("ДатаПрибытия"                ,"ДатаПрибытия");
	
	СтруктураПолей.Вставить("КудаВыписанАдрес"                 ,"КудаВыписанАдрес");
	СтруктураПолей.Вставить("ОткудаПрибылАдрес"                ,"ОткудаПрибылАдрес");
	
	СтруктураПолей.Вставить("ДоляПлощади"                 ,"ДоляПлощади");
	СтруктураПолей.Вставить("ДоляПлощади"                 ,"ДоляПлощади");
	СтруктураПолей.Вставить("СтатусФизЛицаДляИзменения"   ,"СтатусФизЛицаДляИзменения");
	
	СтруктураПолей.Вставить("ПравоустанавливающиеДокументы","ПравоустанавливающиеДокументы");
	//++АнисимоваМВ 1бит 05.11.2024 восстановление после сбоя
	//СтруктураПолей.Вставить("лб_СтатусСтрокиДляФЛС"      ,"лб_СтатусСтрокиДляФЛС");
	//СтруктураПолей.Вставить("лб_ДоляПлощадиСтрокой"      ,"лб_ДоляПлощадиСтрокой");
	//СтруктураПолей.Вставить("лб_СтрокаРодствДляФЛС"      ,"лб_СтрокаРодствДляФЛС");
	//СтруктураПолей.Вставить("бит_ПомещенВАрхив"      ,"бит_ПомещенВАрхив");
	//--АнисимоваМВ 1бит 05.11.2024 восстановление после сбоя
	
	СтруктураПолей.Вставить("ДатаПраваСобственности"      ,"ДатаПраваСобственности");
	
	РезультатЗапросаПоФизЛицам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокПроживающих", СтруктураПолей);
	ТаблицаПоФизЛицам          = РезультатЗапросаПоФизЛицам.Выгрузить();
	
	ПроверитьДублиФизлиц(ТаблицаПоФизЛицам, Отказ, Заголовок);
	
	//
	//Проверка = НазначениеОтветственногоПоЛСНаСервере();
	//Если Проверка=1 ТОгда отказ = Истина; КонецЕсли;
	//
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоФизЛицам, Отказ, Заголовок);
		//БИТ Михайлов работы по ЛТ№74 10.01.2022
		Отказ = НазначениеОтветственногоПоЛСНаСервере();
		//КонецРабот
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения" документа.
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ЗаявлениеОРегистрацииПоМестуПЖ")  Тогда
		
		СуществующийДок = НайтиПодчиненнуюРегистрациюПРоживающих(Основание);
		
		Если ЗначениеЗаполнено(СуществующийДок) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='На основании документа %1 был введен %2'"),
			Основание,
			СуществующийДок);
			
			ДополнительныеСвойства.Вставить("ПовтроныйВводНаОсновании", Истина);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат;
			
		КонецЕсли;
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Дата = Основание.Дата;
		
		
		ПараметрыДокументаОснования = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Основание);
		ВидДокументаОснования       = Основание.Метаданные().Имя;
		
		ДокументОснование = ПараметрыДокументаОснования.Ссылка;
		
		ЛицевойСчет = ДокументОснование.ЛицевойСчет;
		
		НоваяСтрокаФизЛиц = СписокПроживающих.Добавить();
		НоваяСтрокаФизЛиц.ФизЛицо                = ДокументОснование.РегистрируемоеЛицо;
		
		СведенияИзИстори = ПолучитьСписокПроживающих(ДокументОснование.РегистрируемоеЛицо);
		
		Если НЕ СведенияИзИстори = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрокаФизЛиц, СведенияИзИстори);
		КонецЕсли; 
		
		НоваяСтрокаФизЛиц.ДатаРегистрации        = ?(ЗначениеЗаполнено(ДокументОснование.ДатаРегистрации)       ,ДокументОснование.ДатаРегистрации        ,НоваяСтрокаФизЛиц.ДатаРегистрации);
		НоваяСтрокаФизЛиц.ДатаСнятияСРегистрации = ?(ЗначениеЗаполнено(ДокументОснование.ДатаСнятияСРегистрации),ДокументОснование.ДатаСнятияСРегистрации ,НоваяСтрокаФизЛиц.ДатаСнятияСРегистрации );
		
		Если ЗначениеЗаполнено(ДокументОснование.ДатаСнятияСРегистрации) Тогда
			НоваяСтрокаФизЛиц.ПричинаВыписки   = Справочники.бит_ПричиныВыписки.ОкончаниеВремениРегистрации;
		КонецЕсли; 
		
		НоваяСтрокаФизЛиц.СтатусФизЛица          = ?(ЗначениеЗаполнено(НоваяСтрокаФизЛиц.СтатусФизЛица)         ,НоваяСтрокаФизЛиц.СтатусФизЛица          ,Справочники.бит_СтатусФизЛица.ВременнаяРегистрация);
		НоваяСтрокаФизЛиц.СтепеньРодства         = ?(ЗначениеЗаполнено(НоваяСтрокаФизЛиц.СтепеньРодства)        ,НоваяСтрокаФизЛиц.СтепеньРодства         ,Справочники.бит_СтепениРодстваФизЛиц.бит_НеУказано);
		НоваяСтрокаФизЛиц.СтатусПроживания       = ?(ЗначениеЗаполнено(НоваяСтрокаФизЛиц.СтатусПроживания)      ,НоваяСтрокаФизЛиц.СтатусПроживания       ,Перечисления.бит_СтатусПроживания.Временно);
		
		НоваяСтрокаФизЛиц.ОткудаПрибылАдрес      = ДокументОснование.ОткудаПрибылАдрес;
		НоваяСтрокаФизЛиц.КудаВыписанАдрес       = ДокументОснование.КудаВыписанАдрес;
		НоваяСтрокаФизЛиц.ОткудаПрибыл           = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ДокументОснование, Справочники.ВидыКонтактнойИнформации.ОткудаПрибылПредставление);
		НоваяСтрокаФизЛиц.КудаВыписан            = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ДокументОснование, Справочники.ВидыКонтактнойИнформации.КудаВыписанПредставление);
		НоваяСтрокаФизЛиц.ДатаПрибытия           = ДокументОснование.ДатаПрибытия;
		
		Если ДокументОснование.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеВСвязиСоСмертью Тогда
			
			НоваяСтрокаФизЛиц.СтатусФизЛица    = Справочники.бит_СтатусФизЛица.Выписан;
			НоваяСтрокаФизЛиц.ПричинаВыписки   = Справочники.бит_ПричиныВыписки.ПоСмертно;
			НоваяСтрокаФизЛиц.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает;
			
		ИначеЕсли ДокументОснование.ВидОперации = Перечисления.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.СнятиеСРегистрационногоУчета Тогда
			
			НоваяСтрокаФизЛиц.СтатусФизЛица    = Справочники.бит_СтатусФизЛица.Выписан;
			НоваяСтрокаФизЛиц.ПричинаВыписки   = Справочники.бит_ПричиныВыписки.ОкончаниеВремениРегистрации;
			
		КонецЕсли;
		
	Иначе
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Функция ПолучитьСписокПроживающих(ФизЛицо)
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &ФизЛицо) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент"     , КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"    , ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено
		
	КонецЕсли; 
	
	Возврат РезультатЗапроса.Выгрузить()[0];
	
КонецФункции

// Процедура - обработчик события "ПередЗаписью". 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СписокЛицевыхСчетов = ""+ЛицевойСчет.Наименование;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Результат = Документы.бит_РегистрацияПроживающихПоЛС.ОбновитьПараметрыЖКХ(Дата, ЛицевойСчет.Организация);
	
	Если НЕ Результат.НачислениеСУчетомДнейПроживания Тогда
		
		Реквизит = ПроверяемыеРеквизиты.Найти("СписокПроживающих.ДатаРегистрации");
		
		Если НЕ Реквизит = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Реквизит);
		КонецЕсли;
		
	КонецЕсли;  
	
	// БИТ_ЖКХ_начало_изменений_22072013
	ПроверитьДатуРегистрацииВручную = Ложь;
	
	// Удалим дату регистрации из списка проверяемых реквизитов,
	// Если  у "Статуса ФЛ" нет галочки "Проживание в данный момент".
	// И "Статус проживания" выставлен в значение "Не проживает". 
	Для Индекс = 0 по СписокПроживающих.Количество()-1 Цикл
		СтрокаСписокПроживающих = СписокПроживающих.Получить(Индекс);
		Если (НЕ СтрокаСписокПроживающих.СтатусФизЛица.ПроживаниеВДанныйМомент)
			И (СтрокаСписокПроживающих.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает) Тогда
			
			Реквизит = ПроверяемыеРеквизиты.Найти("СписокПроживающих.ДатаРегистрации");
			
			Если НЕ Реквизит = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				ПроверитьДатуРегистрацииВручную = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Обходим строки и проверяем заполнение реквизита "Дата регистрации".
	Если ПроверитьДатуРегистрацииВручную Тогда
		Для Индекс = 0 по СписокПроживающих.Количество()-1 Цикл
			СтрокаСписокПроживающих = СписокПроживающих.Получить(Индекс);
			Если Не ЗначениеЗаполнено(СтрокаСписокПроживающих.ДатаРегистрации) Тогда
				Если (НЕ СтрокаСписокПроживающих.СтатусФизЛица.ПроживаниеВДанныйМомент)
					И (СтрокаСписокПроживающих.СтатусПроживания = Перечисления.бит_СтатусПроживания.НеПроживает) Тогда
				Иначе
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "В строке " + (Индекс + 1) + " не заполнена дата регистрации";
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// БИТ_ЖКХ_окончание_изменений_22072013
	
	// БИТ_ЖКХ 19.09.2014
	ПроверитьПричинуВыпискиВручную = Ложь;
	
	Для Индекс = 0 по СписокПроживающих.Количество()-1 Цикл
		СтрокаСписокПроживающих = СписокПроживающих.Получить(Индекс);
		Если НЕ ЗначениеЗаполнено(СтрокаСписокПроживающих.ДатаСнятияСРегистрации) Тогда
			
			Реквизит = ПроверяемыеРеквизиты.Найти("СписокПроживающих.ПричинаВыписки");
			
			Если НЕ Реквизит = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Реквизит);
				ПроверитьПричинуВыпискиВручную = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверитьПричинуВыпискиВручную Тогда
		Для Индекс = 0 по СписокПроживающих.Количество()-1 Цикл
			СтрокаСписокПроживающих = СписокПроживающих.Получить(Индекс);
			Если Не ЗначениеЗаполнено(СтрокаСписокПроживающих.ПричинаВыписки) Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаСписокПроживающих.ДатаСнятияСРегистрации) Тогда
				Иначе
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "В строке " + (Индекс + 1) + " не заполнена причина выписки";
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// БИТ_ЖКХ 19.09.2014

КонецПроцедуры

Функция НайтиПодчиненнуюРегистрациюПРоживающих(Основание) Экспорт
	
	Перем ПодчиненныйДокумент;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_РегистрацияПроживающихПоЛС.Ссылка КАК ПодчиненныйДокумент
	|ИЗ
	|	Документ.бит_РегистрацияПроживающихПоЛС КАК бит_РегистрацияПроживающихПоЛС
	|ГДЕ
	|	бит_РегистрацияПроживающихПоЛС.ДокументОснование = &ДокументОснование
	|	И НЕ бит_РегистрацияПроживающихПоЛС.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПодчиненныйДокумент = Выборка.ПодчиненныйДокумент;
	КонецЕсли;
	
	Возврат ПодчиненныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
